/**
  ******************************************************************************
  * @file    Module_ISR.c
  * @author  Donatello
  * @version V1.0
  * @date    2015.10.09
  * @brief
  ******************************************************************************
  */
/*
*********************************************************************************************************
*                                             INCLUDE FILES
*********************************************************************************************************
*/
#include "Module_ISR.h"

extern bool		Uart1_Rev_Flag;
extern	uint16_t	Stitic_Time_Cnt;

/*******************************************************************************
  * @函数名称	PIT_ISR
  * @函数说明	PIT中断函数
  * @输入参数	无
  * @输出参数	无
  * @返回参数	无
*******************************************************************************/
void PIT_ISR(void)
{
    if(Stitic_Time_Cnt>3000)
    {
        Stitic_Time_Cnt=0;
    }
    else
    {
        Stitic_Time_Cnt++;
    }
#if DEBUG
    //printf("PIT INT\r\n");
#endif
}
/*******************************************************************************
  * @函数名称	RTC_ISR
  * @函数说明	RTC中断函数
  * @输入参数	无
  * @输出参数	无
  * @返回参数	无
*******************************************************************************/
void RTC_ISR(void)
{
#if DEBUG
    printf("RTC INT\r\n");
#endif
}
/*******************************************************************************
  * @函数名称	DMA_ISR
  * @函数说明	DMA中断函数
  * @输入参数	无
  * @输出参数	无
  * @返回参数	无
*******************************************************************************/
void DMA_ISR(void)
{
	Uart1_Rev_Flag = true;
}

/*******************************************************************************
  * @函数名称	UART_TX_ISR
  * @函数说明	串口发送中断回调函数,在函数中写中断想要做的事情
  * @输入参数	无
  * @输出参数	无
  * @返回参数	无
*******************************************************************************/
void UART_TX_ISR(uint16_t * byteToSend)
{
	static const char UART_String1[] = "Usart_Send_Ok\r\n";
    static const char *p = UART_String1;
    *byteToSend = *p++;
    if((p - UART_String1) == sizeof(UART_String1))
    {
        p = UART_String1;
        UART_ITDMAConfig(HW_UART0, kUART_IT_Tx, false);
    }
}

/*******************************************************************************
  * @函数名称	UART_RX_ISR
  * @函数说明	串口接收中断回调函数,在函数中写中断想要做的事情
  * @输入参数	无
  * @输出参数	无
  * @返回参数	无
*******************************************************************************/
void UART_RX_ISR(uint16_t byteReceived)
{
#if	DEBUG
	printf("function:UART_RX_ISR\r\n");
#endif
    UART_WriteByte(HW_UART0, byteReceived);										/* 将接收到的数据发送回去 */
}