/**
  ******************************************************************************
  * @file    Module_Modbus.c
  * @author  Donatello
  * @version V1.0
  * @date    2015.11.10
  * @brief
  ******************************************************************************
  */
/*
*********************************************************************************************************
*                                             INCLUDE FILES
*********************************************************************************************************
*/



#include "Module_Modbus.h"



/*******************************************************************************
  * @函数名称		Modbus_CRC_gen
  * @函数说明		Modbus RTU CRC
  * @输入参数		data start location，data len
  * @输出参数		无
  * @返回参数		CRC data
*******************************************************************************/
uint16_t Modbus_CRC_gen(uint8_t *buf, uint16_t n)
{
	uint16_t crc_result=0xffff;
	uint16_t i, m;

	for (i=0; i<n; i++)
	{
		crc_result ^= *(buf++);
		for (m=0; m<8; m++)
		{
			if(crc_result&0x0001)
			{
				crc_result >>= 1;
				crc_result ^= 0xa001;
			}
			else
			{
				crc_result>>=1;
			}
		}
	}
	return	crc_result;
}
